<?php

return [
    'heading_title'=> 'Вакансії',
    'sidebar_title'=> 'Про компанію',
    'cities'=> 'Міста',
    'more'=> 'Ще вакансії ...',
    'text'=> 'Компанія зацікавлена у залученні професіоналів до своєї команди, і кожен хто хоче приєднатися до колективу «Бон Буассон», будь ласка надсилайте інформацію про себе через форму',
    'contacts'=> 'Контакти',
    'back'=> 'Назад до вакансій',
    'phone'=> 'Телефон:',
    'submit'=> 'Відправити резюме',
    'contact2manager'=> 'Зв\'яжіться з нашим менеджером',
];
