@extends('vendor.voyager-frontend.layouts.default')
@section('meta_title', __('offices.heading_title'))
@section('content')

<div class="background-ripples drop4">
    <img class="shakeBlockTwo" src="{{ url('/') }}/img/svg/drop4.svg" alt="">
</div>
<div class="predstavitelstva-main wow bounceInUp">
    <p class="predstavitelstva-title">{{ __('offices.heading_title') }}</p>
    <div class="predstavitelstva__icons">
        <div class=" link-icon map-block active-map-block">
            <img src="{{ url('/') }}/img/png/map-marker.png" alt="">
            <p>{{ __('offices.map') }}</p>
        </div>
        <div class="link-icon list-block">
            <img src="{{ url('/') }}/img/png/burg.png" alt="">
            <p>{{ __('offices.list') }}</p>
        </div>
    </div>
    <div class="container-map ">
        <div id="osm-map"></div>
    </div>
    <div class="container-list grid">
        
            @php use App\Http\Controllers\OfficeController; @endphp
            @foreach ($cities as $city_id => $offices)
            <div class="city-block grid-item">
                <p class="list-city__title">{{ OfficeController::getCity($city_id)->getTranslatedAttribute('name') }}</p>
                <ul>
                    @foreach ($offices as $office)
                    <li>
                        <p class="list-city__adress">{{ $office->getTranslatedAttribute('street') }}</p>
                        <div class="list-city__phone">
                            @php $phones = explode(',', $office->phone); @endphp
                            @foreach($phones as $phone)
                            <p>{{ $phone }}</p>
                            @endforeach
                        </div>
                    </li>
                    @endforeach
                </ul>
            </div>
            @endforeach
        
    </div>
</div>
<script>
    var element = document.getElementById('osm-map');
        element.style = 'height:740px;';
        var map = L.map(element);
        L.tileLayer('http://{s}.tile.osm.org/{z}/{x}/{y}.png', {
            attribution: '&copy; <a href="http://osm.org/copyright">OpenStreetMap</a> contributors'
        }).addTo(map);
        var mark = L.icon({
            iconUrl: '/img/png/map-marker.png',
            iconSize: 60
        });
        var popup = L.popup({
            className: 'map-popup'
        });
    {{--@if ( config('app.locale') == 'en' )
        var markers = [
                ['50.4501', '30.523400000000038','Kiev<br>st. Danila Galitsky, 3а<br> +38 (067) 500 45 89'],
                ['47.0942647', '37.501696700000025','Mariupol<br>ul. Bahchivandzhi 69<br> +38 (096) 773 67 09'],
                ['46.8389046', '35.34880720000001','Melitopol<br>ul. Schmidt 116/1<br> +38 (067) 524 60 58'],
                ['49.4519649', '26.924175500000047','Khmelnitsky <br> ul. Cooperative, 5<br> +38 (067) 990 52 58'],
                ['49.553517', '25.594767000000047','Ternopil <br> st. Podlesnaya 27<br> +38 (098) 213 97 56'],
                ['50.0249143', '32.969438099999934','Lubny <br> st. Fabrichnaya 4g<br> +38 (067) 524 63 54'],
                ['48.5101152', '35.89580950000004','Pavlograd <br> st. Dnieper 294 D<br> +38 (067) 635 26 06'],
                ['48.04512510000001', '30.888431500000024','Pervomaisk <br> st. Goltyanskaya 101a<br> +38 (067) 552 78 91'],
                ['48.66327039999999', '33.096787500000005','Alexandria <br> per. Znamensky 14a<br> +38 (067) 524 66 06'],
                ['48.5170347', '32.2040968','Kropyvnytskyi<br>Ave. engineers 10<br> +38 (067) 524 66 02'],
                ['48.94451859999999', '38.48907980000001','Severodonetsk <br> st. Fedorenko 4B<br> +38 (067) 524 66 67'],
                ['48.75133659999999', '37.58592999999996','Kramatorsk <br> st. Mayakovsky 3A<br> +38 (067) 524 57 91'],
                ['46.746303', '33.388081899999975','New Kakhovka <br> st. Factory 1<br> +38 (067) 524 85 29'],
                ['51.0377956', '31.888099399999987','Nezhin <br> st. Chernigovskaya, 112 a<br> +38 (067) 550 62 83<br> +38 (095) 870 36 69'],
                ['50.5698695', '32.39684269999998','Pryluky <br> st. Pyryatyn, 115<br> +38 (067) 550 62 83<br> +38 (095) 870 36 69'],
                ['46.746303', '33.388081899999975','Lozova <br> st. Lesnaya, 6<br> +38 (067) 524 61 10'],
                ['48.6329614', '35.22415709999996','Novomoskovsk <br> st. Zhukova, 1a<br> +38 (056) 767 57 20'],
                ['46.9529725', '31.995140900000024','Nikolaev <br> st. Small Sea 108/5<br> +38 (067) 552 79 10'],
                ['50.932339', '34.75047730000006','Sumy <br> st. Putivlskaya 19/1<br> +38 (067) 611 47 03'],
                ['48.7321177', '30.20361349999996','Uman <br> st. Staritskogo 5<br> +38 (067) 627 65 36'],
                ['46.500801', '30.718053000000054','Odessa <br> st. Cerkovnaya, 19<br> +38 (067) 552 79 07'],
                ['47.83380469999999', '35.2259904','Zaporozhye <br> st. Karpenko Kary 47<br> +38 ((067) 627 79 52'],
                ['47.4430691', '35.288488099999995','Vasilyevka <br> st. Likhachev 2A<br> +38 (097) 984 53 14'],
                ['49.938738', '36.263954600000034','Kharkiv<br> st. Gagarin Ave., 183A<br> +38 (067) 611 46 98'],
                ['49.4167632', '32.033449399999995','Cherkasy <br> st. Smelyanskaya 131<br> +38 (067) 524 79 91'],
                ['49.40753369999999', '32.104379900000026','Cherkasy <br> st. Patsava, 2/1<br> +38 (047) 271 13 91<br>+38 (047) 271 05 80'],
                ['49.5930694', '34.48414730000002','Poltava <br> prowl. Perspektivniy 10<br> +38 (067) 524 63 54'],
                ['48.464717', '35.04618299999993','Dnipro <br> st. Danila Galytsky, 3a<br> + 38 (067) 483 44 94'],
                ['48.44937119999999', '35.06761400000005','Dnipro <br> st. Simferopol 17<br> +38 (056) 376 71 63'],
                ['51.4982', '31.289349899999934','Chernihiv <br> st. Gromadskaya 47<br> +38 (095) 870 36 69'],
                ['49.2342179', '28.44262230000004','Vinnitsa <br> st. Danila Galitsky, 3a<br> +38 (067) 500 45 89'],
                ['49.8308963', '23.969845299999974','Lviv, <br> st. Gorodetskaya 367<br> +38 (097) 810 67 31<br>+38 (098) 831 10 16'],
                ['46.6605929', '32.60694979999994','Kherson <br> st. Nekrasov 2<br> +38 (067) 627 65 23']
            ];
    @elseif ( Config::get('app.locale') == 'ru' )
        var markers = [
                ['50.4501', '30.523400000000038','Киев<br> ул. Данила Галицкого, 3а<br> +38 (067) 500 45 89'],
                ['47.0942647', '37.501696700000025','Мариуполь<br> ул. Бахчиванджи 69<br> +38 (096) 773 67 09'],
                ['46.8389046', '35.34880720000001','Мелитополь<br> ул. Шмидта 116/1<br> +38 (067) 524 60 58'],
                ['49.4519649', '26.924175500000047','Хмельницкий<br> ул. Кооперативная, 5<br> +38 (067) 990 52 58'],
                ['49.553517', '25.594767000000047','Тернополь<br> ул. Подлесная 27<br> +38 (098) 213 97 56'],
                ['50.0249143', '32.969438099999934','Лубны<br> ул. Фабричная 4г<br> +38 (067) 524 63 54'],
                ['48.5101152', '35.89580950000004','Павлоград<br> ул. Днепровская 294 Д<br> +38 (067) 635 26 06'],
                ['48.04512510000001', '30.888431500000024','Первомайск<br> ул. Голтянская 101а<br> +38 (067) 552 78 91'],
                ['48.66327039999999', '33.096787500000005','Александрия<br> пер. Знаменский 14а<br> +38 (067) 524 66 06'],
                ['48.5170347', '32.2040968','Кропивницкий<br> пр-т Инженеров 10<br> +38 (067) 524 66 02'],
                ['48.94451859999999', '38.48907980000001','Северодонецк<br> ул. Федоренко 4Б<br> +38 (067) 524 66 67'],
                ['48.75133659999999', '37.58592999999996','Краматорск<br> ул. Маяковского 3А<br> +38 (067) 524 57 91'],
                ['46.746303', '33.388081899999975','Новая Каховка<br> ул. Фабричная 1<br> +38 (067) 524 85 29'],
                ['51.0377956', '31.888099399999987','Нежин<br> ул. Черниговская, 112 а<br> +38 (067) 550 62 83<br> +38 (095) 870 36 69'],
                ['50.5698695', '32.39684269999998','Прилуки<br> ул. Пирятинская, 115<br> +38 (067) 550 62 83<br> +38 (095) 870 36 69'],
                ['46.746303', '33.388081899999975','Лозовая<br> ул. Лесная, 6<br> +38 (067) 524 61 10'],
                ['48.6329614', '35.22415709999996','Новомосковск<br> ул. Жукова, 1а<br> +38 (056) 767 57 20'],
                ['46.9529725', '31.995140900000024','Николаев<br> ул. Малая Морская 108/5<br> +38 (067) 552 79 10'],
                ['50.932339', '34.75047730000006','Сумы<br> ул. Путивльская, 19/1<br> +38 (067) 611 47 03'],
                ['48.7321177', '30.20361349999996','Умань<br> ул. Старицкого 5<br> +38 (067) 627 65 36'],
                ['46.500801', '30.718053000000054','Одесса<br> ул. Церковная, 19<br> +38 (067) 552 79 07'],
                ['47.83380469999999', '35.2259904','Запорожье<br> ул. Карпенко карого 47<br> +38 ((067) 627 79 52'],
                ['47.4430691', '35.288488099999995','Васильевка<br> ул. Лихачёва 2А<br> +38 (097) 984 53 14'],
                ['49.938738', '36.263954600000034','Харьков<br> пр. Гагарина, 183А<br> +38 (067) 611 46 98'],
                ['49.4167632', '32.033449399999995','Черкассы<br> ул. Смелянская 131<br> +38 (067) 524 79 91'],
                ['49.40753369999999', '32.104379900000026','Черкассы<br> ул. Пацаєва, 2/1<br> +38 (047) 271 13 91<br>+38 (047) 271 05 80'],
                ['49.5930694', '34.48414730000002','Полтава<br> проул. Перспективный 10<br> +38 (067) 524 63 54'],
                ['48.464717', '35.04618299999993','Днепр<br> ул. Данилы Галыцького, 3а<br> + 38 (067) 483 44 94'],
                ['48.44937119999999', '35.06761400000005','Днепр<br> ул. Симферопольская 17<br> +38 (056) 376 71 63'],
                ['51.4982', '31.289349899999934','Чернигов<br> ул. Громадская, 47<br> +38 (095) 870 36 69'],
                ['49.2342179', '28.44262230000004','Виница<br> ул. Данила Галицкого, 3а<br> +38 (067) 500 45 89'],
                ['49.8308963', '23.969845299999974','Львов<br> ул. Городецкая 367<br> +38 (097) 810 67 31<br>+38 (098) 831 10 16'],
                ['46.6605929', '32.60694979999994','Херсон<br> ул. Некрасова 2<br> +38 (067) 627 65 23'],
            ];
    @elseif ( Config::get('app.locale') == 'ua' )
        var markers = [
                ['50.4501 ', '30.523400000000038', 'Київ <br> вул. Данила Галицького, 3а <br> +38 (067) 500 45 89 '],
                ['47.0942647 ', '37.501696700000025', 'Маріуполь <br> вул. Бахчиванджи 69 <br> +38 (096) 773 67 09 '],
                ['46.8389046 ', '35.34880720000001', 'Мелітополь <br> вул. Шмідта 116/1 <br> +38 (067) 524 60 58 '],
                ['49.4519649 ', '26.924175500000047', 'Хмельницький <br> вул. Кооперативна, 5 <br> +38 (067) 990 52 58 '],
                ['49.553517 ', '25.594767000000047', 'Тернопіль <br> вул. Підлісна 27 <br> +38 (098) 213 97 56 '],
                ['50.0249143 ', '32.969438099999934', 'Лубни <br> вул. Фабрична 4г <br> +38 (067) 524 63 54 '],
                ['48.5101152 ', '35.89580950000004', 'Павлоград <br> вул. Дніпровська 294 Д <br> +38 (067) 635 26 06 '],
                ['48.04512510000001 ', '30.888431500000024', 'Первомайськ <br> вул. Голтянський 101а <br> +38 (067) 552 78 91 '],
                ['48.66327039999999 ', '33.096787500000005', 'Олександрія <br> пров. Знаменський 14а <br> +38 (067) 524 66 06 '],
                ['48.5170347 ', '32.2040968', 'Кропивницький <br> пр-т Інженерів 10 <br> +38 (067) 524 66 02'],
                ['48.94451859999999 ', '38.48907980000001', 'Сєвєродонецьк <br> вул. Федоренко 4Б <br> +38 (067) 524 66 67 '],
                ['48.75133659999999 ', '37.58592999999996', 'Краматорськ <br> вул. Маяковського 3А <br> +38 (067) 524 57 91 '],
                ['46.746303 ', '33.388081899999975', 'Нова Каховка <br> вул. Фабрична 1 <br> +38 (067) 524 85 29 '],
                ['51.0377956 ', '31.888099399999987', 'Ніжин <br> вул. Чернігівська, 112 а <br> +38 (067) 550 62 83 <br> +38 (095) 870 36 69 '],
                ['50.5698695 ', '32.39684269999998', 'Прилуки <br> вул. Пирятинська, 115 <br> +38 (067) 550 62 83 <br> +38 (095) 870 36 69 '],
                ['46.746303 ', '33.388081899999975', 'Лозова <br> вул. Лісова, 6 <br> +38 (067) 524 61 10 '],
                ['48.6329614 ', '35.22415709999996', 'Новомосковськ <br> вул. Жукова, 1а <br> +38 (056) 767 57 20 '],
                ['46.9529725 ', '31.995140900000024', 'Миколаїв <br> вул. Мала Морська 108/5 <br> +38 (067) 552 79 10 '],
                ['50.932339 ', '34.75047730000006', 'Суми <br> вул. Путивльська, 19/1 <br> +38 (067) 611 47 03 '],
                ['48.7321177 ', '30.20361349999996', 'Умань <br> вул. Старицького 5 <br> +38 (067) 627 65 36 '],
                ['46.500801 ', '30.718053000000054', 'Одеса <br> вул. Церковна, 19 <br> +38 (067) 552 79 07 '],
                ['47.83380469999999 ', '35.2259904', 'Запоріжжя <br> вул. Карпенко Карого 47 <br> +38 ((067) 627 79 52 '],
                ['47.4430691 ', '35.288488099999995', 'Василівка <br> вул. Лихачова 2А <br> +38 (097) 984 53 14 '],
                ['49.938738 ', '36.263954600000034', 'Харків <br> пр. Гагаріна, 183А <br> +38 (067) 611 46 98'],
                ['49.4167632 ', '32.033449399999995', 'Черкаси <br> вул. Смілянська 131 <br> +38 (067) 524 79 91 '],
                ['49.40753369999999 ', '32.104379900000026', 'Черкаси <br> вул. Пацаєва, 2/1 <br> +38 (047) 271 13 91 <br> +38 (047) 271 05 80 '],
                ['49.5930694 ', '34.48414730000002', 'Полтава <br> пров. Перспективний 10 <br> +38 (067) 524 63 54 '],
                ['48.464717 ', '35.04618299999993', 'Дніпро <br> вул. Данила Галицького, 3а <br> + 38 (067) 483 44 94 '],
                ['48.44937119999999 ', '35.06761400000005', 'Дніпро <br> вул. Сімферопольська 17 <br> +38 (056) 376 71 63 '],
                ['51.4982 ', '31.289349899999934', 'Чернігів <br> вул. Громадська, 47 <br> +38 (095) 870 36 69 '],
                ['49.2342179 ', '28.44262230000004', 'Виница <br> вул. Данила Галицького, 3а <br> +38 (067) 500 45 89 '],
                ['49.8308963 ', '23.969845299999974', 'Львів <br> вул. Городоцька 367 <br> +38 (097) 810 67 31 <br> +38 (098) 831 10 16 '],
                ['46.6605929 ', '32.60694979999994', 'Херсон <br> вул. Некрасова 2 <br> +38 (067) 627 65 23 ']
            ];
    @endif--}}
    var markers = <?php echo $coordinates; ?> ;
    map.setView(L.latLng(markers[0][0], markers[0][1]), 8);
    L.marker(L.latLng(markers[0][0], markers[0][1]), {
                icon: mark,
                opacity: 1
            })
            .addTo(map)
            .bindPopup(markers[0][2])
            .openPopup();
    var lang = $('html').attr('lang');
    for (let i=0; i<markers.length; i++) {
        let cityDiscription = markers[i][2];
        //console.log(markers[i][2]);
        let address_pieces = markers[i][2].split('<br>');
        let city = address_pieces[0];
        let street_pieces = address_pieces[1].split(' ');
        let street_number = street_pieces.pop();
        if (street_pieces == 'ул.') {
            street_pieces = "";
        }
        street_pieces.shift();
        let street = street_pieces.join(' ').replace(',', '').replace('ул.', '');
        let res = [street_number, street].join(' ');
        let result = [res, city].join(', ');
        console.log(result);
        let coordinates = '';
        $.ajax({
            dataType: "json",
            url: "https://nominatim.openstreetmap.org/search?q=" + result + "&format=json&polygon=1&addressdetails=1&accept-language=" + lang,
            success: function (data) {
                console.log(data);
                if (data[0].lat) {
                    console.log(data[0].lat);
                    console.log(data[0].lon);
                    let coordinates = L.latLng(data[0].lat, data[0].lon);
                    if (coordinates) {
                        L.marker(
                            coordinates, {
                                icon: mark,
                                opacity: 0.8,
                                title: cityDiscription.replace(/<br>/g, ' ')}
                        ).addTo(map).bindPopup(cityDiscription);
                    }
                }
                console.log(coordinates);
            },
            error: function (data) {
                console.log(data);
            }
        });
        //var coordinates = L.latLng(markers[i][0], markers[i][1]);


   }
</script>
@stop