<?php

return [
    'heading_title'=> 'Вакансии',
    'sidebar_title'=> 'О компании',
    'cities'=> 'Города',
    'more'=> 'Ещё вакансии...',
    'text'=> 'Компанія зацікавлена у залученні професіоналів до своєї команди, і кожен хто хоче приєднатися до колективу «Бон Буассон», будь ласка надсилайте інформацію про себе через форму',
    'contacts'=> 'Контакты',
    'back'=> 'Назад к вакансиям',
    'phone'=> 'Телефон:',
    'submit'=> 'Отправить резюме',
    'contact2manager'=> 'Свяжитесь с нашим менеджером',
];
